{"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "data_format": "channels_last", "trainable": true, "name": "conv2d_1", "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "bias_constraint": null, "padding": "valid", "activity_regularizer": null, "dilation_rate": [1, 1], "dtype": "float32", "batch_input_shape": [null, 64, 64, 3], "strides": [1, 1], "filters": 32, "kernel_size": [3, 3]}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_1", "strides": [2, 2], "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "data_format": "channels_last", "trainable": true, "name": "conv2d_2", "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "bias_constraint": null, "padding": "valid", "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "strides": [1, 1], "filters": 32, "kernel_size": [3, 3]}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_2", "strides": [2, 2], "pool_size": [2, 2]}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "units": 128, "name": "dense_1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "trainable": true, "use_bias": true}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "sigmoid", "units": 1, "name": "dense_2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "trainable": true, "use_bias": true}}], "keras_version": "2.1.5", "backend": "tensorflow"}